{
  "Version": "0.2.14.5",
  "Date": "2016-11-16T00:00:00",
  "Notes": "#### Important Release Notes\r\nThis branch (0.2.14.x) implements some BIG changes in the way that MedLaunch handles configurations on disk. The 'Base Configuration' filter has been completed removed so that you just have a separate button for each system.\r\n\r\nAn option has been added to settings (on by default) that saves a system-specific cfg file to the root of the Mednafen directory whenever you launch a game. You can disable this in the settings but there is less chance of a screw-up if you don't. If you are precious about these cfg files (nes.cfg, psx.cfg etc.) then please back them up before you proceed.\r\n\r\nYou will also notice an amber button on the Configs page called 'IMPORT ALL CONFIGS FROM DISK'. When you click this the following happens:\r\n\r\n* The contents of the main Mednafen configuration file are loaded into MedLaunch (mednafen-09x.cfg)\r\n* All general (non-system-specific) options are applied to EVERY system configuration in MedLaunch\r\n* Then every single system config file (snes.cfg, pce.cfg etc.) is loaded into MedLaunch and applied to the correct system\r\n\r\nYou are also asked if you want to import all configs every time you choose a new Mednafen directory within MedLaunch.\r\n\r\nYou can also right-click on a system filter in MedLaunch and choose to import just the system.cfg file from disk for this system (useful if you have made manual changes to a system.cfg file and want to import these changes into MedLaunch without having to import every config, and before it gets overwritten by running a game).\r\n\r\nWhen you launch a game all config options for the selected system are still supplied via the command line (therefore the mednafen-09x.cfg file is updated automatically by Mednafen itself)\r\n\r\nPlease note: Netplay and Server settings are still independent of system configurations. You can set these up once in MedLaunch and not have to worry.\r\n\r\nFinally there is another setting (also on by default) that creates a uniquely named backup of your existing Mednafen-09x.cfg file (in the root of the Mednafen directory) every time you start MedLaunch.\r\n\r\nHopefully these changes will mean that the way MedLaunch handles configurations is more intuitive to the average user, and more functional for those people who want to generate config files through a GUI for use in other Front-Ends/Launchers.\r\n\r\n#### New Install\r\n* Extract this release to a folder, run the 'MedLaunch.exe' executable and choose your Mednafen directory (must be the Mednafen 0.9.39.x branch and 64-bit version if you want to emulate Saturn games). \r\n* You are then prompted to choose whether to import all config settings from your Mednafen folder into the MedLaunch database (this is recommended).\r\n* If you currently use system-specific config files with Mednafen the settings from these will be imported with the above process. However MedLaunch will write to these files when you launch a game - so back them up somewhere if you are not happy with this.\r\n\r\n#### Upgrade\r\n##### Preferred Method: \r\n* Automatically download and upgrade using the 'Updates' tab within MedLaunch itself.\r\n* Once MedLaunch has upgraded, go to the 'Configs' tab and click the 'IMPORT ALL CONFIGS FROM DISK' button\r\n\r\n##### Manual Method: \r\n* You can safely extract this new release over an existing MedLaunch folder (providing you do not have MedLaunch running at the time) \r\n* Once extracted run the MedLaunch.exe executable and your current database will be upgraded before the application starts proper.\r\n* Once MedLaunch has upgraded, go to the 'Configs' tab and click the 'IMPORT ALL CONFIGS FROM DISK' button",
  "Changelog": [
    "* Fixed control iteration bug where pce_fast (and possibly snes_faust) command line arguments were not being generated correctly",
    "* Mednafen config backups are now stored in the MedLaunch folder (.\\Data\\MednafenCFGBackups\\)",
    "* Fixed some config controls not setting correctly",
    "* Added messagebox on initial database creation - asking whether user wants to enable auto-check for updates on start"
  ]
}