{
  "Version": "0.4.0.0",
  "Date": "2017-01-21T00:00:00",
  "Notes": "#### Important Release Notes\r\n** This MedLaunch release is *ONLY* compatible with version 0.9.41.x of Mednafen. Do *NOT* upgrade if you are not planning to update Mednafen also **\r\n\r\n#### New Install\r\n* Extract this release to a folder, run the 'MedLaunch.exe' executable and choose your Mednafen directory (must be the Mednafen 0.9.41.x branch - 64-bit version is required if you want to emulate Saturn games). \r\n* You are then prompted to choose whether to import all config settings from your Mednafen folder into the MedLaunch database (this is recommended).\r\n* If you currently use system-specific config files with Mednafen the settings from these will be imported with the above process. However MedLaunch will write to these files when you launch a game - so back them up somewhere if you are not happy with this.\r\n\r\n#### Upgrade\r\n##### Preferred Method: \r\n* Automatically download and upgrade using the 'Updates' tab within MedLaunch itself.\r\n* Ensure you have the correct version of Mednafen installed (v0.9.41.x)\r\n* Once MedLaunch has upgraded, go to the 'Configs' tab and click the 'IMPORT ALL CONFIGS FROM DISK' button\r\n* In settings change your mednafen directory if you installed the new version of mednafen somewhere else\r\n\r\n##### Manual Method: \r\n* You can safely extract this new release over an existing MedLaunch folder (providing you do not have MedLaunch running at the time) \r\n* Once extracted run the MedLaunch.exe executable and your current database will be upgraded before the application starts proper.\r\n* Once MedLaunch has upgraded, go to the 'Configs' tab and click the 'IMPORT ALL CONFIGS FROM DISK' button\r\n* In settings change your mednafen directory if you installed the new version of mednafen somewhere else",
  "Changelog": [
    "* Implemented config control changes for the latest Mednafen release",
    "* Added a Mednafen version check on game launch (to avoid errors with wrong versions)",
    "* Fixed some minor errors in the Mednafen config control names",
    "* Added tooltips on config controls based on Mednafen documentation (can be turned off/on in settings)"
  ]
}